<?php
//-------------------------------------------------------------------------------------
// Calendar Setting Area
//-------------------------------------------------------------------------------------
$title = "UNICALE";
//-------------------------------------------------------------------------------------
//メンバーの定義
function fullMemberList(){
	//※1：凡例表示の際に，直前につけるスペースの個数
	//            表示順         Key     略称         FULL     凡例表示=1  1文字  (※1) 縮小表示=1
	$fullMemberList[0]  = array("MEM1", "聖徳",    "聖徳太子",   1,        "聖",   0,   0 );
	$fullMemberList[1]  = array("MEM2", "新渡戸",  "新渡戸稲造", 1,        "稲",   0,   0 );
	$fullMemberList[2]  = array("MEM3", "樋口",    "樋口一葉",   1,        "樋",   0,   0 );
	$fullMemberList[3]  = array("MEM4", "野口",    "野口英世",   1,        "野",   0,   0 );
	$fullMemberList[4]  = array("MEM5", "伊藤",    "伊藤博文",   1,        "伊",   2,   1 );
	$fullMemberList[5]  = array("MEM6", "板垣",    "板垣退助",   1,        "板",   0,   1 );
	$fullMemberList[6]  = array("MEM7", "夏目",    "夏目漱石",   1,        "夏",   0,   1 );
	$fullMemberList[7]  = array("MEM8", "徳川",    "徳川家康",   1,        "徳",   0,   1 );
	$fullMemberList[8]  = array("MEM9", "源",      "源義家",     0,        "源",   2,   1 );
	$fullMemberList[9]  = array("ME10", "岩倉",    "岩倉具視",   0,        "岩",   0,   1 );
	$fullMemberList[10] = array("ME11", "福沢",    "福沢諭吉",   0,        "福",   0,   1 );
	$fullMemberList[11] = array("ME12", "菅原",    "菅原道真",   0,        "菅",   0,   1 );
	$fullMemberList[12] = array("ME13", "謙信",    "上杉謙信",   0,        "上",   0,   1 );
	$fullMemberList[13] = array("ME14", "兼続",    "直江兼続",   0,        "直",   0,   1 );
	$fullMemberList[14] = array("ME15", "景勝",    "上杉景勝",   0,        "勝",   0,   1 );
	$fullMemberList[15] = array("ME16", "景虎",    "上杉景虎",   0,        "虎",   0,   1 );
	$fullMemberList[16] = array("ME17", "菊姫",    "武田菊姫",   0,        "菊",   0,   1 );
	$fullMemberList[17] = array("ME18", "柿崎",    "柿崎晴家",   0,        "柿",   0,   1 );
	$fullMemberList[18] = array("ME19", "秀吉",    "泉沢久秀",   0,        "泉",   0,   1 );
	$fullMemberList[19] = array("ME20", "明智",    "明智光秀",   0,        "明",   0,   1 );
	$fullMemberList[20] = array("ME21", "石田",    "石田三成",   0,        "石",   0,   1 );
	$fullMemberList[21] = array("ME22", "武田",    "武田勝頼",   0,        "武",   0,   1 );
	$fullMemberList[22] = array("ME23", "北条",    "北条氏政",   0,        "北",   0,   1 );
	$fullMemberList[23] = array("ME24", "千",      "千利休",     0,        "千",   0,   1 );

	return($fullMemberList);
	//人数は上記の書き方を参考にして，1人以上何人にでも増減できます。最大15名くらいが使い勝手的には上限でしょう。
	//Key：他の人と重複しないようにしてください。
	//     また，KeyはCSSのスタイル名とも連動していますので，あまり修正しないほうがよいでしょう。
	//凡例表示：0の時は，画面上部の凡例に表示しません。1の時は表示します。
	//縮小表示：チームとなんとなく関係のある人を表示する時，1にしておくと，凡例で小さく表示します。
}

//-------------------------------------------------------------------------------------
//予定ジャンルの定義
function genreArray(){
	//                     Key   ジャンル名  工数集計対象
	$genreArray[0] = Array("999","無分類",    0 );//無分類のKeyは変更しないでください。
	$genreArray[1] = Array("001","プロジェクトＡ",  1 );
	$genreArray[2] = Array("002","プロジェクトＢ",  1 );
	$genreArray[3] = Array("003","プロジェクトＣ",1 );
	$genreArray[4] = Array("004","内部作業",1 );
	$genreArray[5] = Array("005","間接作業",1 );
	$genreArray[6] = Array("006","ジャンル６",0 );
	return($genreArray);
	//人数は上記の書き方を参考にして，ジャンルの個数を増減できます。
	//Key：他のジャンルのKeyと重複しないようにしてください。
	//     また，KeyはCSSのスタイル名とも連動していますので，あまり修正しないほうがよいでしょう。
	//工数集計対象：0の時はそのジャンルの工数集計をしません。1の時には工数集計をジャンルごとに行う対象とします。
}
//-------------------------------------------------------------------------------------

?>
